In [ ]:
%pip install pandas

In [ ]:
import pandas as pd

data = {
    'Name':['Rahul','Rohan','Tiya','Riya','Diana','Joy','Nishant','Heena','Deep'],
    'Age' :[23,34,45,67,23,24,12,50,22],
    'city':['tokya','Paris','Mumbai','Surat','Bhuj','Jaipur','Pune','Pune','Mumbai']
}

df = pd.DataFrame(data)
print(df)

In [ ]:
data = [
    ['Rahul',23 ,'tokya'],
    ['joy',12,'Jaipur'],
    ['Nishant',34,'Mumbai']
]

col = ['Name','Age','City']

df = pd.DataFrame(data,columns=col)
print(df)

In [ ]:
# https://raw.githubusercontent.com/Pankaj-Str/Complete-Python-Mastery/refs/heads/main/53%20DataSet/credit_card_transactions.csv

data = pd.read_csv("credit_card_transactions.csv")
# data = pd.read_csv("https://raw.githubusercontent.com/Pankaj-Str/Complete-Python-Mastery/refs/heads/main/53%20DataSet/ecommerce_data.csv")

print(data.head(7))

In [ ]:
# df = pd.read_excel('data.xlsx')
# df = pd.read_json('data.json')

In [ ]:
# print 5 rows of the dataframe
print(data.head())

In [ ]:
# print last 5 rows of the dataframe
print(data.tail())

In [ ]:
# check data types of each column
print(data.dtypes)

In [ ]:
# check information about the dataframe
print(data.info())

In [ ]:
# describe the dataframe
print(data.describe())

In [ ]:
# shape of the dataframe
print(data.shape)

In [ ]:
# print column names
print(data.columns)

In [ ]:
data_columns = data.columns.tolist()
# print(data_columns)

for i in data_columns:
    print(i)

In [ ]:
# indexes of the dataframe
print(data.index)

In [ ]:
# selecting data from dataframe
print(data['Amount'])

In [ ]:
col2 = ['Amount','Location']
print(data[col2])

In [ ]:
# row by index
print(data.iloc[2])

In [ ]:
# select row 100 to 110
print(data.iloc[100:111])

In [ ]:
print(data.iloc[:,3])

In [ ]:
# row by label
print(data.loc[5])

In [ ]:
# row 0 - 10 and columns 'Amount' and 'Location'
print(data.loc[0:10, ['Amount','Location']])

In [ ]:
# conditional selection

# print rows where Amount > 4000

print(data[data['Amount'] > 4000])

In [ ]:
# print row amount > 4000 with  transaction type 'Online'
new_record = data[(data['Amount'] > 4000) & (data['Transaction_Type'] == 'Online')]
# export new_record to csv
new_record.to_csv('new_record.csv', index=False)

In [ ]:
# Date : 30 oct 2025
# adding and modifying columns

data = {
    'Name':['Rahul','Rohan','Tiya','Riya','Diana','Joy','Nishant','Heena','Deep'],
    'Age' :[23,34,45,67,23,24,12,50,22],
    'city':['tokya','Paris','Mumbai','Surat','Bhuj','Jaipur','Pune','Pune','Mumbai']
}

df = pd.DataFrame(data)
print(df)

In [ ]:
# add new column salary 

df['Salary'] = [50000,60000,55000,70000,65000,48000,72000,80000,62000]
print(df)

In [ ]:
# modify existing column # age + 2
df['Age'] = df['Age'] + 2
print(df)

In [ ]:
import numpy as np
# add new row 
new_row = {'Name':None,'Age': np.nan,'city':'Delhi','Salary':np.nan}
row = pd.DataFrame([new_row])
# concat the new row to the dataframe
df = pd.concat([df,row], ignore_index=True)
print(df)

In [ ]:
# handling missing data 
df.isnull().sum()

In [ ]:
# delete row null value
df = df.dropna()
print(df)

In [ ]:
new_row = {'Name':"Joy",'Age': np.nan,'city':'Delhi','Salary':np.nan}
row = pd.DataFrame([new_row])
# concat the new row to the dataframe
df = pd.concat([df,row], ignore_index=True)
print(df)

In [ ]:
df.isnull().sum()

In [ ]:

df['Age'] = df['Age'].fillna(df['Age'].mean())

In [ ]:
df.isnull().sum()

In [ ]:
df['Salary'] = df['Salary'].fillna(0)
# check again for null values
df.isnull().sum()

In [ ]:
# add name column with 'Unknown' where null
df['Name'] = df['Name'].fillna('Unknown')
print(df)

In [ ]:
# check again null values
df.isnull().sum()

In [ ]:
# remove all duplicates value 
df = df.drop_duplicates()
print(df)

In [ ]:
# find the duplicates
duplicates = df.duplicated()
print(duplicates)

# find total duplicates
total_duplicates = df.duplicated().sum()
print("Total duplicates:", total_duplicates)

In [ ]:
df = df.drop_duplicates(subset=['city'])
print(df)

In [ ]:
# reset index 
df = df.drop_duplicates().reset_index(drop=True)
print(df)

In [101]:
# Sorting the DataFrame
# sort by Age ascending
df = df.sort_values(by='Age')
print(df)

      Name   Age    city   Salary
6  Nishant  14.0    Pune  72000.0
4    Diana  25.0    Bhuj  65000.0
0    Rahul  25.0   tokya  50000.0
5      Joy  26.0  Jaipur  48000.0
7     Amit  30.0   Delhi  75000.0
1    Rohan  36.0   Paris  60000.0
2     Tiya  47.0  Mumbai  55000.0
3     Riya  69.0   Surat  70000.0

In [ ]:
# sort by age descending
df = df.sort_values(by='Age', ascending=False)
print(df)

In [ ]:
# sort multiple columns
df = df.sort_values(by=['city','Age'])
print(df)

In [119]:
# add new row 
new_row = {'Name':'yiyo','Age':46,'city':'Bhuj','Salary':90000}
# use concat to add new row
row = pd.DataFrame([new_row])
df = pd.concat([df,row], ignore_index=True)

In [120]:
print(df)

       Name   Age    city   Salary
0   Nishant  14.0    Pune  72000.0
1     Diana  25.0    Bhuj  65000.0
2     Rahul  25.0   tokya  50000.0
3       Joy  26.0  Jaipur  48000.0
4      Amit  30.0   Delhi  75000.0
5     Rohan  36.0   Paris  60000.0
6      Tiya  47.0  Mumbai  55000.0
7      Riya  69.0   Surat  70000.0
8      Amit  30.0   Delhi  75000.0
9       Joy  30.0   Delhi  75000.0
10     riya  30.0   Delhi  75000.0
11     tiya  30.0   Delhi  75000.0
12      Roy  30.0  Mumbai  75000.0
13      Toy  45.0  Mumbai  89000.0
14     Diya  45.0   Paris  89000.0
15     Jiya  34.0   Paris  45000.0
16    Nishu  34.0  Jaipur  45000.0
17    Sonal  34.0    Pune  78000.0
18   Soniya  34.0    bhuj  78000.0
19    Sumit  46.0    Bhuj  90000.0
20   Taniya  46.0    Bhuj  90000.0
21     Kiyo  46.0    Bhuj  90000.0
22     yiyo  46.0    Bhuj  90000.0
23     yiyo  46.0    Bhuj  90000.0

In [124]:
# grouping data & aggregation

# group by city and count number of people in each city
city_count = df.groupby('city').size()
print(city_count)

city
Bhuj      6
Delhi     5
Jaipur    2
Mumbai    3
Paris     3
Pune      2
Surat     1
bhuj      1
tokya     1
dtype: int64

In [126]:
# find the max and min Salary in each city
age_stats = df.groupby('city')['Salary'].agg(['max','min'])
print(age_stats)

            max      min
city
Bhuj    90000.0  65000.0
Delhi   75000.0  75000.0
Jaipur  48000.0  45000.0
Mumbai  89000.0  55000.0
Paris   89000.0  45000.0
Pune    78000.0  72000.0
Surat   70000.0  70000.0
bhuj    78000.0  78000.0
tokya   50000.0  50000.0